bookers1-debug/app/controllers/books_controller.rb

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "body_b"], ["created_at", "2020-04-04 11:21:46.907160"], ["updated_at", "2020-04-04 11:21:46.907160"], ["title", "title_a"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2020-04-04 11:19:37.515160"], ["id", 1]]
---
  def update
      book=Book.find(params[:id])
      Book.update(book_params)